src/ExternalDataProcessors/Номер/Номер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>Номер</name>
  <attributes>
    <name>Number</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sort</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TypeN</name>
    <type>
      <types>CatalogRef.RoomTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RTCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RTSort</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RTDescroption</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RTNOMBITR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RTMNOPIR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

src/ExternalDataProcessors/Номер/Forms/Форма/Module.bsl
&AtClient
Procedure OnOpen(Cancel)
	Объект.Date =ТекущаяДата();
EndProcedure



&AtServer
Процедура СоздатьДокументПриходаНаСервере()

	NewElement = Документы.AddRoom.СоздатьДокумент();
	
	NewElement.Date = Объект.Date;
	NewElement.RoomNumber = Объект.Number;
	NewElement.SortCode = Объект.Sort;
	NewElement.RoomType = Объект.TypeN;
	NewElement.Hotel=SessionParameters.CurrentHotel;
	
	NumberOfBed = catalogs.RoomTypes.Select();
		While NumberOfBed.Next() do
			if NumberOfBed.Description=NewElement.RoomType.Description Then
				NewElement.NumberOfBedsPerRoom=NumberOfBed.NumberOfBedsPerRoom;	
				NewElement.NumberOfPersonsPerRoom=NumberOfBed.NumberOfPersonsPerRoom;
			Else 
				Continue;	
			EndIf;
		EndDo;
	
	NewElement.Write(DocumentWriteMode.Posting);
	                   
КонецПроцедуры





&наСервере
Процедура промежуточнаяИнфорамцияНаСервере()
	
КонецПроцедуры


&НаКлиенте
Процедура ПромежуточнаяИнфа(Команда)
	промежуточнаяИнфорамцияНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНомер(Команда)
	СоздатьДокументПриходаНаСервере();
	 
КонецПроцедуры


&AtClient
Procedure AddType(Command)
	AddTypeAtServer();
	
EndProcedure

&AtServer
Procedure AddTypeAtServer()
	RTNew = Catalogs.RoomTypes.CreateItem();
	RTNew.Code = Объект.RTCode;
	RTNew.SortCode = Объект.RTSort;
	RTNew.Description = Объект.RTDescroption;
	RTNew.NumberOfBedsPerRoom = Объект.RTMNOPIR;
	RTNew.NumberOfPersonsPerRoom = Объект.RTNOMBITR;
	RTNew.Owner =SessionParameters.CurrentHotel;
	RTNew.Write();
EndProcedure
